benchmarkingExperiments/data/initial_experiments/16t16c900rps.out
Running 1m test @ http://172.31.22.216:5000/yolo
  16 threads and 16 connections
  Thread calibration: mean lat.: 1229.197ms, rate sampling interval: 4542ms
  Thread calibration: mean lat.: 1197.702ms, rate sampling interval: 4403ms
  Thread calibration: mean lat.: 1172.318ms, rate sampling interval: 4337ms
  Thread calibration: mean lat.: 1188.306ms, rate sampling interval: 4427ms
  Thread calibration: mean lat.: 1213.447ms, rate sampling interval: 4526ms
  Thread calibration: mean lat.: 1206.304ms, rate sampling interval: 4411ms
  Thread calibration: mean lat.: 1188.944ms, rate sampling interval: 4374ms
  Thread calibration: mean lat.: 1270.711ms, rate sampling interval: 4485ms
  Thread calibration: mean lat.: 1166.019ms, rate sampling interval: 4349ms
  Thread calibration: mean lat.: 1165.637ms, rate sampling interval: 4354ms
  Thread calibration: mean lat.: 1232.338ms, rate sampling interval: 4448ms
  Thread calibration: mean lat.: 1184.071ms, rate sampling interval: 4374ms
  Thread calibration: mean lat.: 1181.573ms, rate sampling interval: 4435ms
  Thread calibration: mean lat.: 1210.885ms, rate sampling interval: 4399ms
  Thread calibration: mean lat.: 1295.179ms, rate sampling interval: 4694ms
  Thread calibration: mean lat.: 1202.567ms, rate sampling interval: 4468ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.33s     5.02s   18.24s    55.83%
    Req/Sec    38.18      5.74    45.00     88.57%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.31s 
 75.000%   14.89s 
 90.000%   16.92s 
 99.000%   18.01s 
 99.900%   18.19s 
 99.990%   18.24s 
 99.999%   18.25s 
100.000%   18.25s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2504.703     0.000000            1         1.00
    3852.287     0.100000         3108         1.11
    4960.255     0.200000         6210         1.25
    6086.655     0.300000         9316         1.43
    7479.295     0.400000        12423         1.67
   10305.535     0.500000        15519         2.00
   12754.943     0.550000        17072         2.22
   13254.655     0.600000        18633         2.50
   13746.175     0.650000        20174         2.86
   14204.927     0.700000        21727         3.33
   14893.055     0.750000        23286         4.00
   15122.431     0.775000        24057         4.44
   15548.415     0.800000        24838         5.00
   15998.975     0.825000        25623         5.71
   16318.463     0.850000        26388         6.67
   16605.183     0.875000        27172         8.00
   16719.871     0.887500        27562         8.89
   16924.671     0.900000        27947        10.00
   17121.279     0.912500        28334        11.43
   17268.735     0.925000        28717        13.33
   17399.807     0.937500        29128        16.00
   17465.343     0.943750        29292        17.78
   17547.263     0.950000        29529        20.00
   17629.183     0.956250        29703        22.86
   17711.103     0.962500        29878        26.67
   17809.407     0.968750        30107        32.00
   17842.175     0.971875        30203        35.56
   17874.943     0.975000        30303        40.00
   17907.711     0.978125        30407        45.71
   17924.095     0.981250        30473        53.33
   17956.863     0.984375        30591        64.00
   17973.247     0.985938        30648        71.11
   17989.631     0.987500        30702        80.00
   17989.631     0.989062        30702        91.43
   18006.015     0.990625        30757       106.67
   18038.783     0.992188        30830       128.00
   18038.783     0.992969        30830       142.22
   18055.167     0.993750        30864       160.00
   18071.551     0.994531        30902       182.86
   18071.551     0.995313        30902       213.33
   18087.935     0.996094        30930       256.00
   18087.935     0.996484        30930       284.44
   18104.319     0.996875        30949       320.00
   18120.703     0.997266        30961       365.71
   18137.087     0.997656        30975       426.67
   18153.471     0.998047        30989       512.00
   18153.471     0.998242        30989       568.89
   18153.471     0.998437        30989       640.00
   18169.855     0.998633        31001       731.43
   18169.855     0.998828        31001       853.33
   18186.239     0.999023        31010      1024.00
   18186.239     0.999121        31010      1137.78
   18202.623     0.999219        31021      1280.00
   18202.623     0.999316        31021      1462.86
   18202.623     0.999414        31021      1706.67
   18202.623     0.999512        31021      2048.00
   18219.007     0.999561        31029      2275.56
   18219.007     0.999609        31029      2560.00
   18219.007     0.999658        31029      2925.71
   18219.007     0.999707        31029      3413.33
   18219.007     0.999756        31029      4096.00
   18235.391     0.999780        31033      4551.11
   18235.391     0.999805        31033      5120.00
   18235.391     0.999829        31033      5851.43
   18235.391     0.999854        31033      6826.67
   18235.391     0.999878        31033      8192.00
   18235.391     0.999890        31033      9102.22
   18235.391     0.999902        31033     10240.00
   18251.775     0.999915        31036     11702.86
   18251.775     1.000000        31036          inf
#[Mean    =    10329.246, StdDeviation   =     5017.787]
#[Max     =    18235.392, Total count    =        31036]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  37740 requests in 1.00m, 6.73MB read
Requests/sec:    628.91
Transfer/sec:    114.85KB