benchmarkingExperiments/data/initial_experiments/1t1c700rps.out
Running 1m test @ http://172.31.22.216:5000/yolo
  1 threads and 1 connections
  Thread calibration: mean lat.: 2962.626ms, rate sampling interval: 10985ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    21.63s     8.71s   37.75s    60.97%
    Req/Sec   264.00     12.39   281.00     50.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   21.71s 
 75.000%   28.79s 
 90.000%   33.65s 
 99.000%   37.39s 
 99.900%   37.75s 
 99.990%   37.78s 
 99.999%   37.78s 
100.000%   37.78s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6258.687     0.000000            1         1.00
    9027.583     0.100000         1296         1.11
   13131.775     0.200000         2591         1.25
   15859.711     0.300000         3884         1.43
   18563.071     0.400000         5182         1.67
   21708.799     0.500000         6475         2.00
   23281.663     0.550000         7124         2.22
   24674.303     0.600000         7767         2.50
   26099.711     0.650000         8418         2.86
   27459.583     0.700000         9062         3.33
   28786.687     0.750000         9709         4.00
   29458.431     0.775000        10033         4.44
   30277.631     0.800000        10357         5.00
   31014.911     0.825000        10684         5.71
   31965.183     0.850000        11008         6.67
   32899.071     0.875000        11330         8.00
   33275.903     0.887500        11489         8.89
   33652.735     0.900000        11654        10.00
   34013.183     0.912500        11819        11.43
   34373.631     0.925000        11984        13.33
   34701.311     0.937500        12137        16.00
   34930.687     0.943750        12217        17.78
   35422.207     0.950000        12299        20.00
   35815.423     0.956250        12379        22.86
   36175.871     0.962500        12466        26.67
   36470.783     0.968750        12544        32.00
   36601.855     0.971875        12581        35.56
   36765.695     0.975000        12628        40.00
   36896.767     0.978125        12666        45.71
   37027.839     0.981250        12706        53.33
   37158.911     0.984375        12745        64.00
   37224.447     0.985938        12766        71.11
   37289.983     0.987500        12788        80.00
   37355.519     0.989062        12811        91.43
   37421.055     0.990625        12833       106.67
   37453.823     0.992188        12844       128.00
   37486.591     0.992969        12856       142.22
   37519.359     0.993750        12866       160.00
   37552.127     0.994531        12876       182.86
   37584.895     0.995313        12887       213.33
   37617.663     0.996094        12898       256.00
   37650.431     0.996484        12909       284.44
   37650.431     0.996875        12909       320.00
   37683.199     0.997266        12921       365.71
   37683.199     0.997656        12921       426.67
   37683.199     0.998047        12921       512.00
   37715.967     0.998242        12931       568.89
   37715.967     0.998437        12931       640.00
   37715.967     0.998633        12931       731.43
   37715.967     0.998828        12931       853.33
   37748.735     0.999023        12943      1024.00
   37748.735     0.999121        12943      1137.78
   37748.735     0.999219        12943      1280.00
   37748.735     0.999316        12943      1462.86
   37748.735     0.999414        12943      1706.67
   37748.735     0.999512        12943      2048.00
   37748.735     0.999561        12943      2275.56
   37748.735     0.999609        12943      2560.00
   37748.735     0.999658        12943      2925.71
   37748.735     0.999707        12943      3413.33
   37748.735     0.999756        12943      4096.00
   37748.735     0.999780        12943      4551.11
   37748.735     0.999805        12943      5120.00
   37748.735     0.999829        12943      5851.43
   37781.503     0.999854        12945      6826.67
   37781.503     1.000000        12945          inf
#[Mean    =    21628.975, StdDeviation   =     8707.288]
#[Max     =    37748.736, Total count    =        12945]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  15570 requests in 1.00m, 2.78MB read
Requests/sec:    259.49
Transfer/sec:     47.39KB