benchmarkingExperiments/data/initial_experiments/2t2c600rps.out
Running 1m test @ http://172.31.22.216:5000/yolo
  2 threads and 2 connections
  Thread calibration: mean lat.: 1116.111ms, rate sampling interval: 3854ms
  Thread calibration: mean lat.: 1106.012ms, rate sampling interval: 3835ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.69s     3.46s   14.38s    58.70%
    Req/Sec   225.40     30.52   250.00     92.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    9.14s 
 75.000%   11.49s 
 90.000%   13.00s 
 99.000%   14.35s 
 99.900%   14.39s 
 99.990%   14.39s 
 99.999%   14.39s 
100.000%   14.39s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2035.711     0.000000            1         1.00
    3690.495     0.100000         2264         1.11
    4481.023     0.200000         4521         1.25
    7188.479     0.300000         6783         1.43
    8232.959     0.400000         9039         1.67
    9142.271     0.500000        11303         2.00
    9568.255     0.550000        12478         2.22
    9936.895     0.600000        13570         2.50
   10616.831     0.650000        14687         2.86
   11067.391     0.700000        15824         3.33
   11485.183     0.750000        16965         4.00
   11698.175     0.775000        17525         4.44
   11993.087     0.800000        18081         5.00
   12132.351     0.825000        18657         5.71
   12435.455     0.850000        19213         6.67
   12730.367     0.875000        19776         8.00
   12853.247     0.887500        20057         8.89
   13000.703     0.900000        20358        10.00
   13156.351     0.912500        20621        11.43
   13451.263     0.925000        20903        13.33
   13672.447     0.937500        21184        16.00
   13778.943     0.943750        21325        17.78
   13885.439     0.950000        21473        20.00
   13959.167     0.956250        21607        22.86
   14041.087     0.962500        21750        26.67
   14106.623     0.968750        21890        32.00
   14155.775     0.971875        21979        35.56
   14180.351     0.975000        22065        40.00
   14196.735     0.978125        22112        45.71
   14245.887     0.981250        22182        53.33
   14286.847     0.984375        22251        64.00
   14311.423     0.985938        22294        71.11
   14319.615     0.987500        22318        80.00
   14335.999     0.989062        22356        91.43
   14352.383     0.990625        22417       106.67
   14360.575     0.992188        22457       128.00
   14360.575     0.992969        22457       142.22
   14360.575     0.993750        22457       160.00
   14368.767     0.994531        22529       182.86
   14368.767     0.995313        22529       213.33
   14368.767     0.996094        22529       256.00
   14368.767     0.996484        22529       284.44
   14368.767     0.996875        22529       320.00
   14376.959     0.997266        22566       365.71
   14376.959     0.997656        22566       426.67
   14376.959     0.998047        22566       512.00
   14376.959     0.998242        22566       568.89
   14376.959     0.998437        22566       640.00
   14376.959     0.998633        22566       731.43
   14385.151     0.998828        22595       853.33
   14385.151     1.000000        22595          inf
#[Mean    =     8694.643, StdDeviation   =     3460.156]
#[Max     =    14376.960, Total count    =        22595]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  27376 requests in 1.00m, 4.88MB read
Requests/sec:    456.24
Transfer/sec:     83.32KB